ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/test_code/us_tick.c
/********************************************************************************

 **** Copyright (C), 2020, xx xx xx xx info&tech Co., Ltd.                ****

 ********************************************************************************
 * File Name     : us_tick.c
 * Date          : 2020-07-20
 * Description   : .Offer a micro second precision counter.
 * Version       : 1.0
 * Function List :
 *
 * Record        :
 * 1.Date        : 2020-07-20
 *   Modification: Created file

*************************************************************************************************************/

#include "us_tick.h"

#include "nrf_log.h"
#include "nrf.h"
#include "nrf_drv_timer.h"
#include "Adxl362.h"
#if NRF_LOG_ENABLED
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#endif
#include <rtc.h>
#include "ad5940.h"

#if defined(PROFILE_TIME_ENABLED) || defined(BLE_NUS_PROFILE_TIME_ENABLED)


const nrfx_timer_t TIMER_INC_MICRO_SEC = NRFX_TIMER_INSTANCE(4);

static void inc_micro_sec(nrf_timer_event_t event_type, void* p_context)
{
}
/*****************************************************************************
 * Function      : get_micro_sec
 * Description   : get micro second time
 * Input         : void
 * Output        : None
 * Return        :
 * Others        :
 * Record
 * 1.Date        : 20200720
 *   Modification: Created function

*****************************************************************************/
uint32_t get_micro_sec(void)
{
    return nrfx_timer_capture(&TIMER_INC_MICRO_SEC,NRF_TIMER_CC_CHANNEL0);
}

/*****************************************************************************
 * Function      : us_timer_init
 * Description   : micro second timer initialization
 * Input         : void
 * Output        : None
 * Return        :
 * Others        :
 * Record
 * 1.Date        : 20200720
 *   Modification: Created function

*****************************************************************************/
uint32_t us_timer_init(void)
{
    uint32_t err_code = NRF_SUCCESS;

    nrfx_timer_config_t timer_cfg  = NRFX_TIMER_DEFAULT_CONFIG;

       timer_cfg.frequency          = (nrf_timer_frequency_t)NRF_TIMER_FREQ_1MHz;
       timer_cfg.mode               =  (nrf_timer_mode_t)NRF_TIMER_MODE_TIMER;
       timer_cfg.bit_width          = (nrf_timer_bit_width_t)NRF_TIMER_BIT_WIDTH_32;
       timer_cfg.interrupt_priority = APP_IRQ_PRIORITY_LOWEST;

     err_code = nrfx_timer_init(&TIMER_INC_MICRO_SEC,&timer_cfg,inc_micro_sec);
     if(NRF_SUCCESS != err_code)
    {
        NRF_LOG_INFO("nrf_drv_timer_init failue,err_code = %d",err_code);
        return err_code;
    }
    nrfx_timer_enable(&TIMER_INC_MICRO_SEC);
    return 0;
}

void us_timer_deinit(void)
{
   nrfx_timer_uninit(&TIMER_INC_MICRO_SEC);
}

void us_timer_reset(void)
{
     // de init timer structure
      nrfx_timer_clear(&TIMER_INC_MICRO_SEC);
}
#endif

#define ADXL_EXT_TRIGGER
#ifdef ADXL_EXT_TRIGGER

const nrf_drv_timer_t TIMER_ADXL = NRF_DRV_TIMER_INSTANCE(1);

extern void invert_adxl_trigger_signal();
extern void enable_adxl_trigger_pin();
extern void disable_adxl_trigger_pin();

extern void invert_adpd_trigger_signal();
extern void enable_adpd_trigger_pin();
extern void disable_adpd_trigger_pin();
extern void reset_trigger_pulses();

volatile uint32_t gTriggerTimerCnt =0, gAdpdTimerCnt=0, gAdxlTimerCnt=0;
volatile uint8_t gAdxlExtTimerRunning = 0;
volatile uint8_t gAdpdRunning=0, gAdxlRunning=0,gTimerRunning=0;
volatile uint8_t gResetTriggerPulseStates = 0;

/*!
                              ADPD ODR: Index to Frequency(Hz) to Timer Ticks(16Mhz clk ticks) Mapping Table
  --------------------------------------------------------------------------------------------------------------
  | Index     |   0      |   1    |   2   |    3     |   4     |   5     |   6     |   7    |   8     |   9    |
  --------------------------------------------------------------------------------------------------------------
  | Freq(Hz)  |   12.5   |   25   |   50  |    100   |   200   |   250   |   300   |  400   |   500   |  1000  |
  --------------------------------------------------------------------------------------------------------------
  --------------------------------------------------------------------------------------------------------------
  | Period(ms)|    80    |   40   |   20  |    10    |    5    |    4    |   3.33  |   2.5  |    2    |    1   |
  --------------------------------------------------------------------------------------------------------------
  | Pulse     |    40    |   20   |   10  |    5     |   2.5   |    2    |  1.66   |  1.25  |    1    |   0.5  |
  | width(ms) |          |        |       |          |         |         |         |        |         |        |
  --------------------------------------------------------------------------------------------------------------

            Frequency to Ticks Conversion assuming 16Mhz clk and Prescaler value of 0.
                  # Ticks = Pulse Width (ms)  * 16000(ticks per ms)
*/

#define TRIGGER_FREQ_STEPS  10u
uint16_t gaAdpdTriggerFreq[TRIGGER_FREQ_STEPS]={12,25,50,100,200,250,300,400,500,1000};
uint8_t gAdpdFreqIndex = 2, gAdpdDecFactor = 1;
uint8_t gAdxlFreqIndex = 2, gAdxlDecFactor = 1;

uint32_t gaExtTriggerTicks[TRIGGER_FREQ_STEPS] = {640000,320000,160000,80000,40000,32000,26667,20000,16000,8000};
uint8_t gExtTriggerFreqIndex = 2;

#ifdef ENABLE_ECG_APP
uint8_t gEcgFreqIndex = 2, gEcgDecFactor = 1;
uint8_t gExtad5940TriggerFreqIndex = 2;
#endif

uint8_t map_adpd_freq_to_index(uint16_t nOdr)
{
  int i;
  for(i=0; i<TRIGGER_FREQ_STEPS; i++)
  {
    if(gaAdpdTriggerFreq[i] >= nOdr)
    {
      return i;
    }
  }
  if(i==TRIGGER_FREQ_STEPS)
    return 2; /*! Wrong ODR chosen, set ODR to 50Hz */
}

#define MAX_ADXL_ODR_INDEX    5
uint8_t map_adxl_freq_to_index(uint8_t nOdrIndex)
{
  /*! Offset of +2 added because of 250,300Hz in between 200 and 400Hz in Ticks Conversion Table*/
  return(( nOdrIndex>=MAX_ADXL_ODR_INDEX)?MAX_ADXL_ODR_INDEX+2:nOdrIndex);
}

#ifdef DEBUG_TIMER_TICKS
uint32_t gaTrigTimings[100];
uint16_t gArrIndex = 0;

uint32_t gaTrigDiff[100];
uint16_t gDiffIndex = 0;
uint32_t gTimestampCp  = 0;
#endif

/**
 * @brief Handler for timer events.
 */
void adxl_timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            if( gAdpdRunning ==1 && gAdxlRunning ==0)
            {
              invert_adpd_trigger_signal();
              gAdpdTimerCnt++;
            }
            else if( gAdpdRunning ==0 && gAdxlRunning ==1)
            {
              invert_adxl_trigger_signal();
              gAdxlTimerCnt++;
            }
            else if( gAdpdRunning ==1 && gAdxlRunning ==1)
            {
              gTriggerTimerCnt++;
              if(gResetTriggerPulseStates)
              {
                reset_trigger_pulses();
                gResetTriggerPulseStates = 0;
              }
              else
              {
                if((gTriggerTimerCnt%gAdxlDecFactor) == 0)
                {
                  invert_adxl_trigger_signal();
#ifdef DEBUG_TIMER_TICKS
                  gTimestampCp = get_sensor_time_stamp();
#endif
                }
                if((gTriggerTimerCnt%gAdpdDecFactor) == 0)
                {
                  invert_adpd_trigger_signal();
#ifdef DEBUG_TIMER_TICKS
                  gaTrigDiff[gDiffIndex] = get_sensor_time_stamp() - gTimestampCp;
                  if(++gDiffIndex >= 100)
                    gDiffIndex = 0;
#endif
                }
              }
            }
#ifdef DEBUG_TIMER_TICKS
              gaTrigTimings[gArrIndex] = get_sensor_time_stamp();
              if(++gArrIndex >= 100)
                gArrIndex = 0;
#endif
            break;

        default:
            //Do nothing.
            break;
    }
}

