ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/test_code/us_tick.c
/*
  Frequency to  ticks conversion table; assuming 16MHz clock source and Prescaler value of 0.
  TODO: Check with Prescaler value of 16; accordingly change the table

                              Frequecny(Hz) to Ticks Conversion Table
  -------------------------------------------------------------------------------------------
  | Index     |   0      |   1    |   2   |    3     |   4     |   5     |   6     |   7    |
  -------------------------------------------------------------------------------------------
  | Freq(Hz)  |   12.5   |   25   |   50  |    100   |   200   |   400   |   400   |   400  |
  -------------------------------------------------------------------------------------------
  -------------------------------------------------------------------------------------------
  | Period(ms)|    80    |   40   |   20  |    10    |    5    |   2.5   |   2.5   |   2.5  |
  -------------------------------------------------------------------------------------------
  | Pulse     |    40    |   20   |   10  |    5     |   2.5   |   1.25  |  1.25   |  1.25  |
  | width(ms) |          |        |       |          |         |         |         |        |
  -------------------------------------------------------------------------------------------

            Frequency to Ticks Conversion assuming 16Mhz clk and Prescaler value of 0.
                  # Ticks = Pulse Width (ms)  * 16000(ticks per ms)

*/

uint32_t gaAdxlTriggerTicks[8] = {640000,320000,160000,80000,40000,20000,20000,20000};

/*!
                              ECG ODR: Index to Frequency(Hz) to Timer Ticks(16Mhz clk ticks) Mapping Table
  ---------------------------------------------------------------------------------------------------------------------------------------------
  | Index     |   0      |   1    |   2   |    3     |   4     |   5     |   6     |   7    |   8     |   9   |  10  |  11   |   12  |   13   |
  ---------------------------------------------------------------------------------------------------------------------------------------------
  | Freq(Hz)  |   12   |   25   |   50  |    100   |   200   |   250   |   300   |  400   |   500   |  600  |  700 |  800  |  900  |  1000  |
  ---------------------------------------------------------------------------------------------------------------------------------------------
  -----------------------------------------------------------------------------------------------------------------------------------------------
  | Period(ms)|    83.33    |   40   |   20  |    10    |    5    |    4    |   3.33  |   2.5  |    2    |    1.66 |  1.42 |  1.25   |  1.11   |  1  |
  -----------------------------------------------------------------------------------------------------------------------------------------------
  | Pulse     |    41.665   |   20   |   10  |    5     |   2.5   |    2    |  1.66   |  1.25  |    1    |   0.83  |  0.71 |  0.625  |  0.55   |  0.5  |
  | width(ms) |          |        |       |          |         |         |         |        |         |         |       |         |         |       |
  -----------------------------------------------------------------------------------------------------------------------------------------------

            Frequency to Ticks Conversion assuming 16Mhz clk and Prescaler value of 0.
                  # Ticks = Pulse Width (ms)  * 16000(ticks per ms)
*/

#define TRIGGER_ECG_FREQ_STEPS 14
uint16_t gaAd5940TriggerFreq[TRIGGER_ECG_FREQ_STEPS]={12,25,50,100,200,250,300,400,500,600,700,800,900,1000};
uint32_t gaExtAd5940TriggerTicks[TRIGGER_ECG_FREQ_STEPS] = {666640,320000,160000,80000,40000,32000,26667,20000,16000,13280,11360,10000,8800,8000};


/*
  Pointer used for choosing values from the Frequency to Ticks conversion table
  By default set to 50hz;
*/
uint8_t gAdxlFreqSelected = 2;
uint8_t gsTrigTimerStartCnt =0, gsTrigTimerStopCnt =0;

void  enable_trigger_timer(uint8_t nOdrIndex)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    //nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    nrf_drv_timer_config_t timer_cfg = {                                                                                    \
    .frequency          = (nrf_timer_frequency_t)NRFX_TIMER_DEFAULT_CONFIG_FREQUENCY,\
    .mode               = (nrf_timer_mode_t)NRFX_TIMER_DEFAULT_CONFIG_MODE,          \
    .bit_width          = (nrf_timer_bit_width_t)NRFX_TIMER_DEFAULT_CONFIG_BIT_WIDTH,\
    .interrupt_priority = APP_IRQ_PRIORITY_HIGHEST,                    \
    .p_context          = NULL                                                       \
    };
    err_code = nrf_drv_timer_init(&TIMER_ADXL, &timer_cfg, adxl_timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = gaExtTriggerTicks[nOdrIndex];
    gExtTriggerFreqIndex = nOdrIndex;

    /*! Update the decimation factor with new timer frequency*/
    gAdpdDecFactor = gaAdpdTriggerFreq[nOdrIndex]/gaAdpdTriggerFreq[gAdpdFreqIndex];//1 << (nOdrIndex - gAdpdFreqIndex);
    gAdxlDecFactor = gaAdpdTriggerFreq[nOdrIndex]/gaAdpdTriggerFreq[gAdxlFreqIndex];//1 << (nOdrIndex - gAdxlFreqIndex);

    nrf_drv_timer_extended_compare(&TIMER_ADXL, NRF_TIMER_CC_CHANNEL0, time_ticks,\
                                  NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&TIMER_ADXL);
    gTimerRunning = 1;
}

void restart_trigger_timer(uint8_t nOdrIndex)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    nrf_drv_timer_uninit(&TIMER_ADXL);    /*! Stop the Timer */

    //nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    nrf_drv_timer_config_t timer_cfg = {                                                                                    \
    .frequency          = (nrf_timer_frequency_t)NRFX_TIMER_DEFAULT_CONFIG_FREQUENCY,\
    .mode               = (nrf_timer_mode_t)NRFX_TIMER_DEFAULT_CONFIG_MODE,          \
    .bit_width          = (nrf_timer_bit_width_t)NRFX_TIMER_DEFAULT_CONFIG_BIT_WIDTH,\
    .interrupt_priority = APP_IRQ_PRIORITY_HIGHEST,                    \
    .p_context          = NULL                                                       \
    };
    err_code = nrf_drv_timer_init(&TIMER_ADXL, &timer_cfg, adxl_timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = gaExtTriggerTicks[nOdrIndex];    /*! Restart the timer with new frequency */
    gExtTriggerFreqIndex = nOdrIndex;

    /*! Update the decimation factor with new timer frequency*/
    gAdpdDecFactor = gaAdpdTriggerFreq[nOdrIndex]/gaAdpdTriggerFreq[gAdpdFreqIndex];//1 << (nOdrIndex - gAdpdFreqIndex);
    gAdxlDecFactor = gaAdpdTriggerFreq[nOdrIndex]/gaAdpdTriggerFreq[gAdxlFreqIndex];//1 << (nOdrIndex - gAdxlFreqIndex);

    nrf_drv_timer_extended_compare(
         &TIMER_ADXL, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&TIMER_ADXL);
}

void disable_trigger_timer(uint8_t nOdrIndex)
{
  if(gsTrigTimerStartCnt == 1)
  {
    gsTrigTimerStartCnt = 0;
    nrf_drv_timer_uninit(&TIMER_ADXL);  /*! stop timer if only one stream is running*/
    /*! Reset all variables to default values*/
    gTriggerTimerCnt = 0;
    gTimerRunning = 0;
    gAdxlFreqIndex = 2;
    gAdpdFreqIndex = 2;
    gExtTriggerFreqIndex = 2;
    gAdpdDecFactor = 1;
    gAdxlDecFactor = 1;
  }
  else
  {
    gsTrigTimerStartCnt--;
    /*! If other stream runs at lower freqeuncy; then restart the timer with lower frequency required*/
    if(nOdrIndex == gExtTriggerFreqIndex)
    {
      if(nOdrIndex != gAdpdFreqIndex)
      {
         restart_trigger_timer(gAdpdFreqIndex);
         gAdpdDecFactor = 1;
      }
      else if(nOdrIndex != gAdxlFreqIndex)
      {
         restart_trigger_timer(gAdxlFreqIndex);
         gAdxlDecFactor = 1;
      }
    }
  }
}

