ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/test_code/us_tick.c
/*
  Flag to indicate if Timer is currently running
  0 --> Timer is Off
  1 --> Timer is On

  By default flag is set to '0'
*/

void enable_adxl_ext_trigger(uint8_t nOdrIndex)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;
    enable_adxl_trigger_pin();
    nOdrIndex = map_adxl_freq_to_index(nOdrIndex);
    if((nOdrIndex > gExtTriggerFreqIndex) || (!gTimerRunning))
    {
      //restart timer; adjust the dec factors
      gAdxlFreqIndex = nOdrIndex;
      if(gTimerRunning)
        restart_trigger_timer(nOdrIndex);
      else
        enable_trigger_timer(nOdrIndex);

    }
    else
    {
      gAdxlFreqIndex = nOdrIndex;
      gAdxlDecFactor = gaAdpdTriggerFreq[gExtTriggerFreqIndex]/gaAdpdTriggerFreq[nOdrIndex];//1 << (nOdrIndex - gAdxlFreqIndex);
    }
    gsTrigTimerStartCnt++;
    gAdxlExtTimerRunning = 1;
    gResetTriggerPulseStates = 1;
    gAdxlRunning = 1;
}


void disable_adxl_ext_trigger(uint8_t nOdrIndex)
{
    nOdrIndex = map_adxl_freq_to_index(nOdrIndex);
    gAdxlRunning = 0;
    disable_trigger_timer(nOdrIndex);
    disable_adxl_trigger_pin();
    gAdxlExtTimerRunning = 0;
}

void set_adxl_trigger_freq(uint8_t nFreq)
{
  nFreq = map_adxl_freq_to_index(nFreq);
  gAdxlFreqSelected = nFreq;
  if(gAdxlRunning && (nFreq != gAdxlFreqIndex))
  {
    /*
      If Timer is currently running, first stop the timer.
      Then restart the timer with new Frequency requested
    */
    disable_adxl_ext_trigger(gAdxlFreqIndex);
//    AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_DISABLE);
//    AdxlDrvSetOperationMode(PRM_MEASURE_STANDBY_MODE);
//
//    AdxlDrvSetOperationMode(PRM_MEASURE_MEASURE_MODE);
//    AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_ENABLE);
    gAdxlFreqIndex = nFreq;
    enable_adxl_ext_trigger(nFreq);
  }
}

void enable_adpd_ext_trigger(uint16_t nOdr)
{
    uint8_t nOdrIndex;
    enable_adpd_trigger_pin();
    nOdrIndex = map_adpd_freq_to_index(nOdr);
    if((nOdrIndex > gExtTriggerFreqIndex) || (!gTimerRunning))
    {
      //restart timer; adjust the dec factors
      gAdpdFreqIndex = nOdrIndex;
      if(gTimerRunning)
        restart_trigger_timer(nOdrIndex);
      else
        enable_trigger_timer(nOdrIndex);
    }
    else
    {
      gAdpdFreqIndex = nOdrIndex;
      gAdpdDecFactor = gaAdpdTriggerFreq[gExtTriggerFreqIndex]/gaAdpdTriggerFreq[nOdrIndex];//1 << (nOdrIndex - gAdpdFreqIndex);
    }
    gsTrigTimerStartCnt++;
    gResetTriggerPulseStates = 1;
    gAdpdRunning = 1;
}


void disable_adpd_ext_trigger(uint16_t nOdr)
{
    uint8_t nOdrIndex;
    gAdpdRunning = 0;
    nOdrIndex = map_adpd_freq_to_index(nOdr);
    disable_trigger_timer(nOdrIndex);
    disable_adpd_trigger_pin();
}
#endif //ADXL_EXT_TRIGGER

#ifdef ENABLE_ECG_APP
const nrf_drv_timer_t TIMER_AD5940 = NRF_DRV_TIMER_INSTANCE(3);

extern void invert_ecg_trigger_signal();
extern void disable_ecg_trigger_pin();
extern void reset_ecg_trigger_signal(bool n_state);
extern void enable_ecg_trigger_pin();
extern void Ad5940FifoCallBack(void);

volatile uint8_t gEcgRunning = 0, gAd5940TimerRunning=0;
volatile uint32_t gad5940TriggerTimerCnt =0,gad5940TriggerPulseCnt = 0;

#define ECG_WATER_MARK_LEVEL    16U

/*FIFO_THRESHOLD_TRIGGERS_CNT = 2 * ECG_WATER_MARK_LEVEL*/
#define FIFO_THRESHOLD_TRIGGERS_CNT       32U

#ifdef DEBUG_ECG
uint32_t timer_start=0,timer_end=0,timer_diff=0,time_gap_based_on_odr;
extern uint32_t ecgodr;
uint32_t time_stamps_deviated[50]={0};
uint32_t ts_cnt=0;
uint16_t fifo_level_timer=0;
uint16_t Fifotimer_count=0;
uint32_t ecg_tick=0,ecg_tick_prev=0,ecg_load_time_diff=0;
#endif

extern uint8_t gnAd5940TimeIrqSet, gnAd5940TimeIrqSet1;
extern uint32_t gn_ad5940_isr_cnt;
extern uint16_t fifo_read_flag;
extern uint32_t gnAd5940TimeCurVal;
extern uint32_t gnAd5940TimeCurVal_copy;
extern volatile uint8_t gnAd5940DataReady;
extern ADI_OSAL_SEM_HANDLE   ecg_task_evt_sem;
volatile uint16_t fifo_threshold_not_four=0;
volatile uint8_t debug_flag=0;
uint8_t gResetEcgTriggerPulse = 0;

#ifdef ECG_POLLING
struct gTrigInfo{
uint32_t gaTrigTime[100];
uint32_t gaTrigCnt[100];
uint16_t nIndex;
}TrigArr;
#endif
void ad5940_timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{

    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
              if(gEcgRunning == 1)
              {
                gad5940TriggerTimerCnt++;
                if(gResetEcgTriggerPulse)
                {
                  gResetEcgTriggerPulse = 0;
                  gad5940TriggerTimerCnt = 0;
                  gad5940TriggerPulseCnt = 0;
                  reset_ecg_trigger_signal(0);  /* set the trigger signal high*/
                }
                else
                {
                  if((gad5940TriggerTimerCnt%gEcgDecFactor) == 0)
                  {
                    invert_ecg_trigger_signal();
                    gad5940TriggerPulseCnt++;
                    if(((gad5940TriggerPulseCnt) % FIFO_THRESHOLD_TRIGGERS_CNT) ==0)
                    {
#ifdef DEBUG_ECG
                           fifo_read_flag = 1;
#endif

                          /* Now there should be fifo data ; number of samples to read is being set in
                            ecg app which FIFO threshold variable*/
                            /* Read current time */
                            gnAd5940TimeCurVal =  get_sensor_time_stamp();
                            /* Increment isr count */
                            gn_ad5940_isr_cnt++;
                            /*Wake up the ecg task to read the samples from FIFO*/
                            adi_osal_SemPost(ecg_task_evt_sem);
                    }
#ifdef DEBUG_ECG
                    else{
                          if(fifo_read_flag == 1 && (((gad5940TriggerPulseCnt-4)%2) ==0) ){
                            gnAd5940TimeCurVal_copy = gnAd5940TimeCurVal;
                            gnAd5940TimeCurVal = get_sensor_time_stamp();
                            if(gnAd5940TimeCurVal_copy != gnAd5940TimeCurVal){
                                  fifo_threshold_not_four += 1;
                                  debug_flag=1;
                            }
                          }
                          /* post ecg semaphore */
                          adi_osal_SemPost(ecg_task_evt_sem);
                    }
#endif
                  }
                }
#ifdef ECG_POLLING
                TrigArr.gaTrigTime[TrigArr.nIndex] = get_sensor_time_stamp();
                TrigArr.gaTrigCnt[TrigArr.nIndex] = gad5940TriggerTimerCnt;
                if(++TrigArr.nIndex >= 99)
                  TrigArr.nIndex = 0;
#endif
              }
          default:
            //Do nothing.
            break;
     }
}

