ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/test_code/us_tick.c
void  enable_ad5940_trigger_timer(uint8_t nOdrIndex)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&TIMER_AD5940, &timer_cfg, ad5940_timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = gaExtAd5940TriggerTicks[nOdrIndex];
    gExtTriggerFreqIndex = nOdrIndex;
    gEcgDecFactor = gaAd5940TriggerFreq[nOdrIndex]/gaAd5940TriggerFreq[gEcgFreqIndex];//1 << (nOdrIndex - gAdxlFreqIndex);
    nrf_drv_timer_extended_compare(&TIMER_AD5940, NRF_TIMER_CC_CHANNEL0, time_ticks, \
                                  NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&TIMER_AD5940);
    gAd5940TimerRunning = 1;
}

uint16_t gad5940TriggerTimerStartCnt =0;
void disable_ad5940_trigger_timer(uint8_t nOdrIndex)
{
  if(gad5940TriggerTimerStartCnt == 1)
  {
    gad5940TriggerTimerStartCnt = 0;
    nrf_drv_timer_uninit(&TIMER_AD5940);  /*! stop timer if only one stream is running*/
    /*! Reset all variables to default values*/
    gad5940TriggerTimerCnt = 0;
    gAd5940TimerRunning = 0;
    gEcgFreqIndex = 2;
    gExtad5940TriggerFreqIndex = 2;
    gEcgDecFactor = 1;
  }
  /*This case is not required as single stream is running on the timer*/
//  else
//  {
//    gad5940TriggerTimerStartCnt--;
//    /*! If other stream runs at lower freqeuncy; then restart the timer with lower frequency required*/
//    if(nOdrIndex == gExtad5940TriggerFreqIndex)
//    {
//        restart_ad5940_trigger_timer(gEcgFreqIndex);
//    }
//  }
}

void restart_ad5940_trigger_timer(uint8_t nOdrIndex)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    nrf_drv_timer_uninit(&TIMER_AD5940);    /*! Stop the Timer */

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&TIMER_AD5940, &timer_cfg, ad5940_timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = gaExtAd5940TriggerTicks[nOdrIndex];    /*! Restart the timer with new frequency */
    gExtTriggerFreqIndex = nOdrIndex;
    gEcgDecFactor = gaAd5940TriggerFreq[nOdrIndex]/gaAd5940TriggerFreq[gEcgFreqIndex];//1 << (nOdrIndex - gAdxlFreqIndex);
    nrf_drv_timer_extended_compare(&TIMER_AD5940, NRF_TIMER_CC_CHANNEL0,\
                                  time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&TIMER_AD5940);
}

uint8_t map_ecg_freq_to_index(uint16_t nOdr)
{
  int i;
  for(i=0; i<TRIGGER_ECG_FREQ_STEPS; i++)
  {
    if(gaAd5940TriggerFreq[i] >= nOdr)
    {
        return i;
    }
  }
  if(i==TRIGGER_ECG_FREQ_STEPS)
    return 2; /*! Wrong ODR chosen, set ODR to 50Hz */
}

void enable_ecg_ext_trigger(uint16_t nOdr)
{
    uint8_t nOdrIndex;
    enable_ecg_trigger_pin();
    reset_ecg_trigger_signal(1); /* set the trigger signal low*/
    nOdrIndex = map_ecg_freq_to_index(nOdr);
    if((nOdrIndex > gExtTriggerFreqIndex) || (!gAd5940TimerRunning))
    {
      //restart timer; adjust the dec factors
      gEcgFreqIndex = nOdrIndex;
      if(gAd5940TimerRunning)
        restart_ad5940_trigger_timer(nOdrIndex);
      else
        enable_ad5940_trigger_timer(nOdrIndex);
    }
    else
    {
      gEcgFreqIndex = nOdrIndex;
      gEcgDecFactor = gaAd5940TriggerFreq[gExtTriggerFreqIndex]/gaAd5940TriggerFreq[nOdrIndex];//1 << (nOdrIndex - gAdpdFreqIndex);
    }
    gad5940TriggerTimerStartCnt++;
    gResetEcgTriggerPulse = 1;
    gEcgRunning = 1;
}

void disable_ecg_ext_trigger(uint16_t nOdr)
{
    uint8_t nOdrIndex;
    nOdrIndex = map_ecg_freq_to_index(nOdr);
    gEcgRunning = 0;
    disable_ad5940_trigger_timer(nOdrIndex);
    disable_ecg_trigger_pin();
}
#endif //ENABLE_ECG_APP